app/controllers/site_controller.rb

SELECT "events".* FROM "events"  WHERE (name like ''Junk'')
---
  def index
    @query = params[:search]
    if @query.blank?
      @events = Event.all

INSERT INTO "events" ("created_at", "date", "location", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-08 05:11:36.324527"], ["date", "2014-07-08 05:11:36.321826"], ["location", "test"], ["name", "test"], ["updated_at", "2014-07-08 05:11:36.324527"]]
---
  def create

    name = params[:name]
    location = params[:location]
    date = params[:date]

    if date.blank?
      date = Time.now
    end

    event = Event.new
    event.name = name
    event.location = location
    event.date = date

    if event.save